lewisf94/ConvoyLink/firmware/apps/convoylink/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# esp_console REPL on UART0 (docs/07 §Provisioning)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_VFS_SUPPORT_TERMIOS=y

# Task watchdog on both idle tasks (T15): a task that stops yielding on
# either core must be caught, not silently starve the others.
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
